Revit 2027 API
RebarBendingDetailType.CreateRealistic Method
 Creates a new RebarBendingDetailType object for full representations.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarBendingDetailType CreateRealistic(
	Document Document
)
Public Shared Function CreateRealistic (
	Document As Document
) As RebarBendingDetailType
public:
static RebarBendingDetailType^ CreateRealistic(
	Document^ Document
)
static member CreateRealistic :
        Document : Document -> RebarBendingDetailType
Parameters
Document Document
 Document to which the new element should be added.
Return Value
RebarBendingDetailType
 The new RebarBendingDetailType object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace